test/all/syntax.expected.callgraph.dot
digraph "CallGraph" {
    node [shape=box];
    node_12 [label="inline fun random(min: Int, max: Int): Int" style=filled fillcolor="#F0F8FF"];
    node_15 [label="fun send(params: SendParameters): Int" style=filled fillcolor="#F0F8FF"];
    node_17 [label="fun test_try(a: Int)"];
    node_18 [label="fun test_loops()"];
    node_19 [label="fun testTryCatch(a: Int)"];
    node_20 [label="fun testLoops()"];
    node_21 [label="fun callAsm(s: Slice): Cell"];
    node_22 [label="TestContract::override get fun getter(): Int"];
    node_23 [label="Z::get fun getter(): Int
[StateRead<a>]"];
    node_24 [label="TestContractF::fun test()"];
    node_25 [label="TParent::fun getA(): Int
[StateRead<a>]"];
    node_26 [label="TestContractT::fun test(): Int"];
    node_27 [label="TestContractT::external()"];
    node_28 [label="EffectTest::init()
[StateWrite<addr,b,s>]"];
    node_29 [label="EffectTest::fun funcWithSend()
[Send,StateRead<addr>]"];
    node_30 [label="EffectTest::fun funcWithStateRead()
[StateRead<addr>]"];
    node_31 [label="EffectTest::fun funcWithStateWrite1()
[StateRead<b,addr,s>,StateWrite<addr>]"];
    node_32 [label="EffectTest::fun funcWithStateWrite2(s: Slice): Address"];
    node_33 [label="EffectTest::fun funcWithMultipleEffects()
[AccessDatetime,PrgUse,PrgSeedInit]"];
    node_34 [label="EffectTest::receive()"];
    node_35 [label="A::get fun m(): map<Int, Int>
[StateRead<m>]"];
    node_36 [label="A::receive()
[StateRead<m>]"];
    node_40 [label="dump"];
    node_41 [label="emptyMap"];
    node_42 [label="m::set"];
    node_43 [label="s::loadRefEx"];
    node_44 [label="TestContractT::getA"];
    node_45 [label="sender"];
    node_46 [label="beginCell"];
    node_47 [label="newAddress"];
    node_48 [label="s::loadAddress"];
    node_49 [label="now"];
    node_50 [label="nativeRandomizeLt"];
    node_51 [label="beginString"];
    node_52 [label="a::append"];
    node_17 -> node_40;
    node_18 -> node_41;
    node_19 -> node_40;
    node_20 -> node_41;
    node_20 -> node_42;
    node_20 -> node_42;
    node_20 -> node_42;
    node_21 -> node_43;
    node_26 -> node_44;
    node_28 -> node_45;
    node_28 -> node_46;
    node_29 -> node_15;
    node_31 -> node_47;
    node_32 -> node_48;
    node_33 -> node_49;
    node_33 -> node_12;
    node_33 -> node_50;
    node_34 -> node_51;
    node_34 -> node_52;
}
