test/all/syntax.expected.callgraph.mmd
graph TD
    node_12["inline fun random(min: Int, max: Int): Int"]
    node_15["fun send(params: SendParameters): Int"]
    node_17["fun test_try(a: Int)"]
    node_18["fun test_loops()"]
    node_19["fun testTryCatch(a: Int)"]
    node_20["fun testLoops()"]
    node_21["fun callAsm(s: Slice): Cell"]
    node_22["TestContract::override get fun getter(): Int"]
    node_23["Z::get fun getter(): Int
[StateRead<a>]"]
    node_24["fun TestContractF::test()"]
    node_25["fun TParent::getA(): Int
[StateRead<a>]"]
    node_26["fun TestContractT::test(): Int"]
    node_27["TestContractT::external()"]
    node_28["EffectTest::init()
[StateWrite<addr,b,s>]"]
    node_29["fun EffectTest::funcWithSend()
[Send,StateRead<addr>]"]
    node_30["fun EffectTest::funcWithStateRead()
[StateRead<addr>]"]
    node_31["fun EffectTest::funcWithStateWrite1()
[StateRead<b,addr,s>,StateWrite<addr>]"]
    node_32["fun EffectTest::funcWithStateWrite2(s: Slice): Address"]
    node_33["fun EffectTest::funcWithMultipleEffects()
[AccessDatetime,PrgUse,PrgSeedInit]"]
    node_34["EffectTest::receive()"]
    node_35["A::get fun m(): map<Int, Int>
[StateRead<m>]"]
    node_36["A::receive()
[StateRead<m>]"]
    node_40["dump"]
    node_41["emptyMap"]
    node_42["m::set"]
    node_43["s::loadRefEx"]
    node_44["TestContractT::getA"]
    node_45["sender"]
    node_46["beginCell"]
    node_47["newAddress"]
    node_48["s::loadAddress"]
    node_49["now"]
    node_50["nativeRandomizeLt"]
    node_51["beginString"]
    node_52["a::append"]
    node_17 --> node_40
    node_18 --> node_41
    node_19 --> node_40
    node_20 --> node_41
    node_20 --> node_42
    node_20 --> node_42
    node_20 --> node_42
    node_21 --> node_43
    node_26 --> node_44
    node_28 --> node_45
    node_28 --> node_46
    node_29 --> node_15
    node_31 --> node_47
    node_32 --> node_48
    node_33 --> node_49
    node_33 --> node_12
    node_33 --> node_50
    node_34 --> node_51
    node_34 --> node_52
    style node_12 fill:#F0F8FF,stroke:#000,stroke-width:1px;
    style node_15 fill:#F0F8FF,stroke:#000,stroke-width:1px;
